src/test/resources/calculateTaxAndTotalServiceRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <respos:CalculateTransactionTotals xmlns:respos="http://schemas.micros.com/RESPOS">
      <respos:ppMenuItems>
        <respos:ResPosAPI_MenuItem>
          <respos:MenuItem>
            <respos:MiObjectNum>10350</respos:MiObjectNum>
            <respos:MiMenuLevel>1</respos:MiMenuLevel>
            <respos:ItemDiscount>
              <respos:DiscReference>0</respos:DiscReference>
            </respos:ItemDiscount>
          </respos:MenuItem>
          <respos:Condiments>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9041004</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
            </respos:ResPosAPI_MenuItemDefinition>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9041007</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
            </respos:ResPosAPI_MenuItemDefinition>
          </respos:Condiments>
        </respos:ResPosAPI_MenuItem>
        <respos:ResPosAPI_MenuItem>
          <respos:MenuItem>
            <respos:MiObjectNum>50006</respos:MiObjectNum>
            <respos:MiMenuLevel>1</respos:MiMenuLevel>
            <respos:ItemDiscount>
              <respos:DiscReference>0</respos:DiscReference>
            </respos:ItemDiscount>
          </respos:MenuItem>
        </respos:ResPosAPI_MenuItem>
        <respos:ResPosAPI_MenuItem>
          <respos:MenuItem>
            <respos:MiObjectNum>20005</respos:MiObjectNum>
            <respos:MiMenuLevel>1</respos:MiMenuLevel>
            <respos:ItemDiscount>
              <respos:DiscReference>0</respos:DiscReference>
            </respos:ItemDiscount>
          </respos:MenuItem>
          <respos:Condiments>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9041004</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
            </respos:ResPosAPI_MenuItemDefinition>
            <respos:ResPosAPI_MenuItemDefinition>
              <respos:MiObjectNum>9041007</respos:MiObjectNum>
              <respos:MiMenuLevel>1</respos:MiMenuLevel>
              <respos:MiReference/>
            </respos:ResPosAPI_MenuItemDefinition>
          </respos:Condiments>
        </respos:ResPosAPI_MenuItem>
      </respos:ppMenuItems>
      <respos:pSubtotalDiscount>
        <respos:DiscObjectNum>3298</respos:DiscObjectNum>
        <respos:DiscAmountOrPercent>5</respos:DiscAmountOrPercent>
      </respos:pSubtotalDiscount>
      <respos:revenueCenter>5</respos:revenueCenter>
      <respos:orderType>5</respos:orderType>
      <respos:employeeNumber>98008</respos:employeeNumber>
    </respos:CalculateTransactionTotals>
  </soapenv:Body>
</soapenv:Envelope>